Repository: jwsscott777/WeldHandbook
Catalog: WeldHandbook/Localization/Localizable.xcstrings
Source language: en
Languages: es_419, fil_ph, ht, pt_br, zh_hans

source: 1. Study the Basic Weld Symbols: Familiarize yourself with the basic weld symbols shown in the table, like square, bevel, V, U, J, flare V, and flare bevel. Understand that these symbols represent the type of weld desired. 2. Learn to Interpret Welding Symbols: Welding symbols are more complex and can include up to eight elements. Understand that these symbols convey detailed welding instructions. Focus on each element, like the reference line, arrow, dimensions, and supplementary symbols. 3. Use Visual Aids: Refer to figures and diagrams, like Fig. 1 in the document, which show the standard location of elements in a welding symbol. Visual aids can help you understand how the symbols are structured and read.
es_419: 1. Estudie los símbolos básicos de soldadura: Familiarícese con los símbolos básicos de soldadura que se muestran en la tabla, como cuadrado, bisel, V, U, J, ensanchamiento V y bisel ensanchado. Comprenda que estos símbolos representan el tipo de soldadura deseada. 2. Aprenda a interpretar los símbolos de soldadura: los símbolos de soldadura son más complejos y pueden incluir hasta ocho elementos. Comprenda que estos símbolos transmiten instrucciones detalladas de soldadura. Concéntrese en cada elemento, como la línea de referencia, la flecha, las dimensiones y los símbolos complementarios. 3. Utilice ayudas visuales: consulte figuras y diagramas, como la Fig. 1 del documento, que muestran la ubicación estándar de los elementos en un símbolo de soldadura. Las ayudas visuales pueden ayudarle a comprender cómo se estructuran y leen los símbolos.
fil_ph: 1. Pag-aralan ang Mga Pangunahing Simbolo ng Weld: Maging pamilyar sa mga pangunahing simbolo ng weld na ipinapakita sa talahanayan, tulad ng square, bevel, V, U, J, flare V, at flare bevel. Unawain na ang mga simbolo na ito ay kumakatawan sa uri ng hinang na nais. 2. Matutong Mag-interpret ng mga Simbolo ng Welding: Ang mga simbolo ng welding ay mas kumplikado at maaaring magsama ng hanggang walong elemento. Unawain na ang mga simbolo na ito ay naghahatid ng mga detalyadong tagubilin sa welding. Tumutok sa bawat elemento, tulad ng reference na linya, arrow, mga dimensyon, at mga pandagdag na simbolo. 3. Gumamit ng Visual Aids: Sumangguni sa mga figure at diagram, tulad ng Fig. 1 sa dokumento, na nagpapakita ng karaniwang lokasyon ng mga elemento sa isang simbolo ng hinang. Makakatulong sa iyo ang mga visual aid na maunawaan kung paano nakabalangkas at binabasa ang mga simbolo.
ht: 1. Etidye senbòl debaz soude yo: Abitye tèt ou ak senbòl soude debaz yo montre nan tablo a, tankou kare, bizote, V, U, J, flare V, ak flare bizote. Konprann ke senbòl sa yo reprezante kalite soude ou vle a. 2. Aprann entèprete senbòl soude yo: senbòl soude yo pi konplèks epi yo ka genyen jiska uit eleman. Konprann ke senbòl sa yo transmèt enstriksyon detaye soude. Konsantre sou chak eleman, tankou liy referans, flèch, dimansyon, ak senbòl siplemantè. 3. Sèvi ak èd vizyèl: Gade figi ak dyagram, tankou Fig. 1 nan dokiman an, ki montre kote estanda eleman yo nan yon senbòl soude. Èd vizyèl yo ka ede w konprann ki jan senbòl yo estriktire ak li.
pt_br: 1. Estude os símbolos básicos de solda: Familiarize-se com os símbolos básicos de solda mostrados na tabela, como quadrado, bisel, V, U, J, alargamento V e bisel alargado. Entenda que estes símbolos representam o tipo de solda desejada. 2. Aprenda a interpretar símbolos de soldagem: Os símbolos de soldagem são mais complexos e podem incluir até oito elementos. Entenda que estes símbolos transmitem instruções detalhadas de soldagem. Concentre-se em cada elemento, como linha de referência, seta, dimensões e símbolos suplementares. 3. Use recursos visuais: Consulte figuras e diagramas, como a Fig. 1 no documento, que mostram a localização padrão dos elementos em um símbolo de soldagem. Os recursos visuais podem ajudá-lo a compreender como os símbolos são estruturados e lidos.
zh_hans: 1.学习基本焊接符号：熟悉表中所示的基本焊接符号，如方形、斜角、V、U、J、喇叭形V和喇叭形斜角。了解这些符号代表所需的焊接类型。 2. 学习解释焊接符号：焊接符号更加复杂，最多可以包含八个元素。了解这些符号传达了详细的焊接说明。关注每个元素，例如参考线、箭头、尺寸和补充符号。 3. 使用视觉辅助工具：参考图形和图表，如文档中的图 1，它显示了焊接符号中元素的标准位置。视觉教具可以帮助您理解符号的结构和阅读方式。

source: GMAW (Gas Metal Arc Welding): This method employs an electric arc between a continuously fed metal electrode wire and the base metal, providing both the heat and filler metal necessary for welding. The welding arc is enveloped by an argon-based shielding gas, occasionally mixed with CO2 and O2 for enhanced performance. GMAW's popularity spans both professionals and novices, owing to its straightforward setup. However, achieving code quality welding demands meticulous adjustments to voltage and wire speed, a feat only attainable with considerable experience. It is a 'Constant Voltage' power source. FCAW (Flux Cored Arc Welding): Sharing many similarities with GMAW, FCAW stands out due to its flux core, a design reminiscent of the SMAW process. This process comes in two variants. The first depends solely on the wire's internal flux for shielding the weld, while the second combines this with an external argon mix gas for superior weld quality, a method often termed 'Dual Shield' flux cored arc welding. It is a 'Constant Voltage' power source.
es_419: GMAW (soldadura por arco metálico con gas): este método emplea un arco eléctrico entre un alambre de electrodo metálico alimentado continuamente y el metal base, proporcionando tanto el calor como el metal de aportación necesarios para la soldadura. El arco de soldadura está envuelto por un gas protector a base de argón, mezclado ocasionalmente con CO2 y O2 para mejorar el rendimiento. La popularidad de GMAW abarca tanto a profesionales como a principiantes, debido a su sencilla configuración. Sin embargo, lograr una soldadura con calidad de código exige ajustes meticulosos del voltaje y la velocidad del alambre, una hazaña que solo se puede lograr con una experiencia considerable. Es una fuente de energía de "voltaje constante". FCAW (Soldadura por arco con núcleo fundente): Compartiendo muchas similitudes con GMAW, FCAW se destaca por su núcleo fundente, un diseño que recuerda al proceso SMAW. Este proceso se presenta en dos variantes. El primero depende únicamente del flujo interno del alambre para proteger la soldadura, mientras que el segundo lo combina con una mezcla de gas externo de argón para una calidad de soldadura superior, un método a menudo denominado soldadura por arco con núcleo fundente de "doble escudo". Es una fuente de energía de "voltaje constante".
fil_ph: GMAW (Gas Metal Arc Welding): Gumagamit ang paraang ito ng electric arc sa pagitan ng patuloy na pinapakain na metal electrode wire at ng base metal, na nagbibigay ng init at filler na metal na kinakailangan para sa welding. Ang welding arc ay nababalutan ng argon-based shielding gas, paminsan-minsan ay hinahalo sa CO2 at O2 para sa pinahusay na pagganap. Ang kasikatan ng GMAW ay sumasaklaw sa parehong mga propesyonal at baguhan, dahil sa diretsong pag-setup nito. Gayunpaman, ang pagkamit ng kalidad ng code na welding ay nangangailangan ng masusing pagsasaayos sa boltahe at bilis ng wire, isang gawaing makakamit lamang nang may malaking karanasan. Ito ay isang 'Constant Voltage' na pinagmumulan ng kuryente. FCAW (Flux Cored Arc Welding): Sa pagbabahagi ng maraming pagkakatulad sa GMAW, ang FCAW ay namumukod-tangi dahil sa flux core nito, isang disenyong nakapagpapaalaala sa proseso ng SMAW. Ang prosesong ito ay may dalawang variant. Ang una ay nakasalalay lamang sa panloob na flux ng wire para sa pagprotekta sa weld, habang ang pangalawa ay pinagsasama ito sa isang panlabas na argon mix gas para sa higit na mataas na kalidad ng weld, isang paraan na kadalasang tinatawag na 'Dual Shield' flux cored arc welding. Ito ay isang 'Constant Voltage' na pinagmumulan ng kuryente.
ht: GMAW (Gas Metal Arc Welding): Metòd sa a anplwaye yon arc elektrik ant yon fil elektwòd metal kontinyèlman manje ak metal debaz la, bay tou de chalè ak metal filler ki nesesè pou soude. Se ark la soude anvlòp pa yon gaz pwoteksyon ki baze sou argon, detanzantan melanje ak CO2 ak O2 pou pèfòmans amelyore. Popilarite GMAW a kouvri tou de pwofesyonèl ak inisyasyon, akòz konfigirasyon senp li yo. Sepandan, reyalize kòd bon jan kalite soude mande ajisteman metikuleu nan vòltaj ak vitès fil, yon feat sèlman reyalize ak eksperyans konsiderab. Li se yon sous pouvwa 'Vòltaj Konstan'. FCAW (Flux Cored Arc Welding): Pataje anpil resanblans ak GMAW, FCAW kanpe akòz nwayo flux li yo, yon konsepsyon okoumansman de pwosesis SMAW la. Pwosesis sa a vini nan de variantes. Premye a depann sèlman sou flux entèn fil la pou pwoteje soude a, pandan y ap dezyèm lan konbine sa a ak yon gaz ekstèn Agon melanj pou bon jan kalite siperyè soude, yon metòd souvan rele 'Doub Shield' flux koud soude arc. Li se yon sous pouvwa 'Vòltaj Konstan'.
pt_br: GMAW (Gas Metal Arc Welding): Este método emprega um arco elétrico entre um fio de eletrodo metálico alimentado continuamente e o metal base, fornecendo o calor e o metal de adição necessários para a soldagem. O arco de soldagem é envolvido por um gás de proteção à base de argônio, ocasionalmente misturado com CO2 e O2 para melhorar o desempenho. A popularidade do GMAW abrange profissionais e novatos, devido à sua configuração simples. No entanto, alcançar uma soldagem com qualidade de código exige ajustes meticulosos na tensão e na velocidade do fio, um feito que só pode ser alcançado com uma experiência considerável. É uma fonte de energia de 'Tensão Constante'. FCAW (Flux Cored Arc Welding): Compartilhando muitas semelhanças com o GMAW, o FCAW se destaca pelo seu núcleo de fluxo, um design que lembra o processo SMAW. Este processo vem em duas variantes. O primeiro depende unicamente do fluxo interno do fio para proteger a solda, enquanto o segundo combina isso com uma mistura de gás argônio externo para qualidade de solda superior, um método frequentemente denominado soldagem a arco com núcleo de fluxo 'Dual Shield'. É uma fonte de energia de 'Tensão Constante'.
zh_hans: GMAW（气体金属电弧焊）：这种方法在连续送入的金属焊丝和母材之间采用电弧，提供焊接所需的热量和填充金属。焊接电弧被氩基保护气体包围，有时会与 CO2 和 O2 混合以增强性能。由于其简单的设置，GMAW 在专业人士和新手中都很受欢迎。然而，实现代码质量焊接需要对电压和焊丝速度进行细致的调整，只有拥有丰富的经验才能实现这一壮举。它是一种“恒压”电源。 FCAW（药芯焊丝电弧焊）：FCAW 与 GMAW 有许多相似之处，但因其药芯焊丝而脱颖而出，其设计让人想起 SMAW 工艺。此过程有两种变体。第一种方法仅依靠焊丝的内部焊剂来保护焊缝，而第二种方法将其与外部氩气混合气体相结合，以实现卓越的焊接质量，这种方法通常称为“双屏蔽”药芯焊丝电弧焊。它是一种“恒压”电源。

source: Oxyacetylene Welding: A classic method, it relies on the combined power of oxygen and acetylene gases to produce a high-heat flame suitable for a range of metals. Although the flame can be employed for brazing – where only the filler metal is melted, leaving the base metal solid – its primary usage in contemporary times is confined to cutting ferrous materials.
es_419: Soldadura con oxiacetileno: un método clásico que se basa en el poder combinado de oxígeno y gases de acetileno para producir una llama de alto calor adecuada para una variedad de metales. Aunque la llama se puede emplear para soldadura fuerte (donde sólo se funde el metal de aportación, dejando sólido el metal base), su uso principal en la época contemporánea se limita al corte de materiales ferrosos.
fil_ph: Oxyacetylene Welding: Isang klasikong paraan, umaasa ito sa pinagsamang kapangyarihan ng oxygen at acetylene gas upang makagawa ng mataas na init na apoy na angkop para sa isang hanay ng mga metal. Bagama't ang apoy ay maaaring gamitin para sa pagpapatigas - kung saan ang filler metal lamang ang natutunaw, na iniiwan ang base metal na solid - ang pangunahing paggamit nito sa kontemporaryong panahon ay limitado sa pagputol ng mga ferrous na materyales.
ht: Oxyacetylene Welding: Yon metòd klasik, li konte sou pouvwa konbine oksijèn ak gaz asetilèn pou pwodwi yon flanm dife ki wo-chalè apwopriye pou yon seri de metal. Malgre ke flanm dife a ka itilize pou brase - kote se sèlman metal la ranpli fonn, kite metal debaz la solid - itilizasyon prensipal li nan tan kontanporen se limite a koupe materyèl fèr.
pt_br: Soldagem oxiacetileno: Um método clássico, que se baseia no poder combinado dos gases oxigênio e acetileno para produzir uma chama de alto calor adequada para uma variedade de metais. Embora a chama possa ser empregada para brasagem – onde apenas o metal de adição é derretido, deixando o metal base sólido – seu uso principal na contemporaneidade se limita ao corte de materiais ferrosos.
zh_hans: 氧乙炔焊接：一种经典方法，它依靠氧气和乙炔气体的结合力产生适合多种金属的高热火焰。尽管火焰可用于钎焊（仅熔化填充金属，使母材保持固态），但其在当代的主要用途仅限于切割黑色金属材料。

source: Shielded Metal Arc Welding (SMAW) Filler Metals: * For SMAW, also known as stick welding, the filler metals come in the form of coated electrodes. These electrodes consist of a core wire coated with a flux that protects the molten weld pool from atmospheric contamination. An example of a common filler metal for SMAW is the E6013 electrode, which is suitable for mild steel welding and offers moderate penetration and a stable arc. Another example is the E7018 electrode, which is characterized by low hydrogen content and is often used for welding critical structures where higher tensile strength is needed.
es_419: Metales de aportación para soldadura por arco metálico protegido (SMAW): * Para SMAW, también conocida como soldadura con electrodo revestido, los metales de aportación se presentan en forma de electrodos revestidos. Estos electrodos constan de un núcleo de alambre recubierto con un fundente que protege el baño de soldadura fundida de la contaminación atmosférica. Un ejemplo de metal de aportación común para SMAW es el electrodo E6013, que es adecuado para soldadura de acero dulce y ofrece una penetración moderada y un arco estable. Otro ejemplo es el electrodo E7018, que se caracteriza por un bajo contenido de hidrógeno y se utiliza a menudo para soldar estructuras críticas donde se necesita una mayor resistencia a la tracción.
fil_ph: Mga Metal na Tagapuno ng Shielded Metal Arc Welding (SMAW): * Para sa SMAW, na kilala rin bilang stick welding, ang mga filler metal ay nasa anyo ng mga coated electrodes. Ang mga electrodes na ito ay binubuo ng isang core wire na pinahiran ng flux na nagpoprotekta sa molten weld pool mula sa atmospheric contamination. Ang isang halimbawa ng karaniwang filler metal para sa SMAW ay ang E6013 electrode, na angkop para sa mild steel welding at nag-aalok ng moderate penetration at isang stable arc. Ang isa pang halimbawa ay ang E7018 electrode, na kung saan ay nailalarawan sa pamamagitan ng mababang nilalaman ng hydrogen at kadalasang ginagamit para sa welding ng mga kritikal na istruktura kung saan kinakailangan ang mas mataas na lakas ng makunat.
ht: Kouvèti Metal Arc Soude (SMAW) Filler Metals: * Pou SMAW, ke yo rele tou baton soude, metal yo ranpli vini nan fòm lan nan elektwòd kouvwi. Elektwòd sa yo konpoze de yon fil nwayo kouvwi ak yon flux ki pwoteje pisin nan soude fonn kont kontaminasyon atmosferik. Yon egzanp yon metal filler komen pou SMAW se elektwòd E6013, ki apwopriye pou soude asye grav epi li ofri pénétration modere ak yon arc ki estab. Yon lòt egzanp se elektwòd E7018, ki karakterize pa kontni idwojèn ki ba epi li souvan itilize pou soude estrikti kritik kote pi wo fòs rupture ki nesesè.
pt_br: Metais de adição para soldagem por arco de metal blindado (SMAW): * Para SMAW, também conhecido como soldagem eletromagnética, os metais de adição vêm na forma de eletrodos revestidos. Esses eletrodos consistem em um núcleo de arame revestido com um fluxo que protege a poça de fusão da contaminação atmosférica. Um exemplo de metal de adição comum para SMAW é o eletrodo E6013, que é adequado para soldagem de aço-carbono e oferece penetração moderada e arco estável. Outro exemplo é o eletrodo E7018, que se caracteriza pelo baixo teor de hidrogênio e é frequentemente utilizado para soldagem de estruturas críticas onde é necessária maior resistência à tração.
zh_hans: 屏蔽金属电弧焊 (SMAW) 填充金属： * 对于 SMAW（也称为棒焊），填充金属采用涂层焊条的形式。这些电极由涂有助焊剂的芯线组成，可保护熔化的焊池免受大气污染。 SMAW 的常见填充金属的一个例子是 E6013 焊条，它适用于低碳钢焊接，并提供中等熔深和稳定的电弧。又如E7018焊条，其特点是含氢量低，常用于焊接需要较高抗拉强度的关键结构。

source: SMAW (Shielded Metal Arc Welding): A process where an electric arc is passed through a flux-coated electrode, which matches the base metal's type, resulting in the melting of both the electrode and the base metal. Praised for its versatility, SMAW finds applications from minor repairs to intensive pipe welding. A significant advantage lies in its resilience against windy outdoor conditions. It is a 'Constant Current' power source. GTAW (Gas Tungsten Arc Welding): A technique where heat is generated between a tungsten electrode and the base metal. Unlike other processes, the filler metal is introduced separately to the molten puddle. Shielding typically involves 100% argon, though thicker aluminum demands an argon-helium mix for rapid puddle development. GTAW is especially favored for welding stainless steel and other specialty metals. It is a 'Constant Current' power source.
es_419: SMAW (soldadura por arco metálico blindado): proceso en el que se pasa un arco eléctrico a través de un electrodo recubierto con fundente, que coincide con el tipo de metal base, lo que resulta en la fusión tanto del electrodo como del metal base. Elogiado por su versatilidad, SMAW encuentra aplicaciones desde reparaciones menores hasta soldadura intensiva de tuberías. Una ventaja significativa reside en su resistencia al viento en el exterior. Es una fuente de energía de "corriente constante". GTAW (soldadura por arco de tungsteno con gas): técnica en la que se genera calor entre un electrodo de tungsteno y el metal base. A diferencia de otros procesos, el metal de aportación se introduce por separado en el charco fundido. El blindaje normalmente implica 100% argón, aunque el aluminio más grueso requiere una mezcla de argón y helio para el rápido desarrollo de charcos. GTAW es especialmente preferido para soldar acero inoxidable y otros metales especiales. Es una fuente de energía de "corriente constante".
fil_ph: SMAW (Shielded Metal Arc Welding): Isang proseso kung saan ang isang electric arc ay ipinapasa sa isang flux-coated electrode, na tumutugma sa uri ng base metal, na nagreresulta sa pagkatunaw ng electrode at base metal. Pinuri para sa versatility nito, nakakahanap ang SMAW ng mga aplikasyon mula sa maliliit na pag-aayos hanggang sa intensive pipe welding. Ang isang makabuluhang bentahe ay nakasalalay sa katatagan nito laban sa mahangin na mga kondisyon sa labas. Ito ay isang 'Constant Current' power source. GTAW (Gas Tungsten Arc Welding): Isang pamamaraan kung saan nabubuo ang init sa pagitan ng tungsten electrode at ng base metal. Hindi tulad ng iba pang mga proseso, ang filler metal ay ipinakilala nang hiwalay sa tinunaw na puddle. Karaniwang kinasasangkutan ng shielding ang 100% argon, kahit na ang mas makapal na aluminyo ay nangangailangan ng argon-helium mix para sa mabilis na pag-unlad ng puddle. Ang GTAW ay lalo na pinapaboran para sa pagwelding ng hindi kinakalawang na asero at iba pang mga espesyal na metal. Ito ay isang 'Constant Current' power source.
ht: SMAW (Shielded Metal Arc Welding): Yon pwosesis kote yon arc elektrik pase nan yon elektwòd koule-kouvwi, ki matche ak kalite metal debaz la, sa ki lakòz fonn nan tou de elektwòd la ak metal debaz la. Fè lwanj pou adaptabilite li yo, SMAW jwenn aplikasyon pou soti nan reparasyon minè ak soude tiyo entansif. Yon avantaj enpòtan se nan rezistans li kont kondisyon deyò van. Li se yon sous kouran 'Konstan Kouran'. GTAW (Gas Tungstène Arc Welding): Yon teknik kote chalè pwodui ant yon elektwòd tengstèn ak metal debaz la. Kontrèman ak lòt pwosesis, metal filler la prezante separeman nan ti mas dlo fonn lan. Pwoteksyon tipikman enplike 100% agon, menm si aliminyòm pi epè mande yon melanj agon-elyòm pou devlopman rapid ti mas dlo. GTAW se espesyalman favorize pou soude asye pur ak lòt metal espesyal. Li se yon sous kouran 'Konstan Kouran'.
pt_br: SMAW (Soldagem por Arco de Metal Blindado): Processo em que um arco elétrico passa através de um eletrodo revestido com fluxo, que corresponde ao tipo do metal base, resultando na fusão do eletrodo e do metal base. Elogiado pela sua versatilidade, o SMAW encontra aplicações desde pequenos reparos até soldagem intensiva de tubos. Uma vantagem significativa reside na sua resiliência contra condições externas de vento. É uma fonte de energia de 'corrente constante'. GTAW (Gas Tungsten Arc Welding): Uma técnica onde o calor é gerado entre um eletrodo de tungstênio e o metal base. Ao contrário de outros processos, o metal de adição é introduzido separadamente na poça de fusão. A blindagem normalmente envolve 100% de argônio, embora o alumínio mais espesso exija uma mistura de argônio-hélio para o rápido desenvolvimento de poças. GTAW é especialmente preferido para soldagem de aço inoxidável e outros metais especiais. É uma fonte de energia de 'corrente constante'.
zh_hans: SMAW（屏蔽金属电弧焊）：电弧穿过与母材类型相匹配的涂有助焊剂的电极的过程，导致电极和母材熔化。 SMAW 因其多功能性而受到赞誉，其应用范围涵盖从小型维修到密集管道焊接。一个显着的优势在于它能够抵御多风的户外条件。它是一种“恒流”电源。 GTAW（钨极气体保护焊）：一种在钨电极和母材之间产生热量的技术。与其他工艺不同，填充金属被单独引入熔池中。屏蔽通常使用 100% 氩气，但较厚的铝需要氩氦混合气才能快速形成熔池。 GTAW 特别适用于焊接不锈钢和其他特种金属。它是一种“恒流”电源。
